import React from 'react';

export default () => (
    <div id="terms-of-use" className="">
        <div id="terms-of-use-body" className="app-text-color-dark-gray">
            <div>
                <h3>利用規約</h3>

                この利用規約（以下、「本規約」といいます。）は、サービス運営者ZYGOPTERA（以下、「運営者」といいます。）がこのウェブサイト上で提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下、「ユーザー」といいます。）には、本規約に従って、本サービスをご利用いただきます。

                <h4>第1条（適用）</h4>
                本規約は、ユーザーと運営者との間の本サービスの利用に関わる一切の関係に適用されるものとします。

                <h4>第2条（利用の同意）</h4>
                サービス利用希望者が本サービス内において本規約への同意を示すことによって、運営者は利用を承認します。<br />
                運営者は、サービス利用希望者に以下の事由があると判断した場合、利用を承認しないことがあり、その理由については一切の開示義務を負わないものとします。<br />
                （1）利用申請に際して虚偽の事項を届け出た場合<br />
                （2）本規約に違反したことがある者からの申請である場合<br />
                （3）その他、運営者が利用申請を相当でないと判断した場合<br />

                <h4>第3条（コンテンツの配布と制限）</h4>
                ユーザーは、自己の責任において、本サービス内に声および体の動き、各アプリケーションファイルなどのデジタルコンテンツをアップロードするものとします。<br />
                運営者は、ユーザーがアップロードした全てのデジタルコンテンツを、一定の期間において本サービスから公衆に発信します。<br />
                運営者は、ユーザーがアップロードした全てのデジタルコンテンツを、ユーザーに事前に通知することなく削除できるものとします。<br />
                運営者は、ユーザーが本サービスからのデジタルコンテンツの発信停止を求めた場合、対応可能な範囲で発信停止を行うよう務めるものとします。<br />

                <h4>第4条（禁止事項）</h4>
                ユーザーは、本サービスの利用にあたり、以下の行為をしてはなりません。<br /><br />

                （1）法令または公序良俗に違反する行為<br />
                （2）犯罪行為に関連する行為<br />
                （3）運営者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為<br />
                （4）運営者のサービスの運営を妨害するおそれのある行為<br />
                （5）他のユーザーに関する個人情報等を収集または蓄積する行為<br />
                （6）他のユーザーに成りすます行為<br />
                （7）運営者のサービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為<br />
                （8）自身に使用権がないデジタルコンテンツをアップロードする行為<br />
                （9）その他、運営者が不適切と判断する行為<br />

                <h4>第5条（本サービスの提供の停止等）</h4>
                運営者は、以下のいずれかの事由があると判断した場合、ユーザーに事前に通知することなく本サービスの全部または一部の提供を停止または中断することができるものとします。<br />
                （1）本サービスにかかるコンピュータシステムの保守点検または更新を行う場合<br />
                （2）地震、落雷、火災、停電または天災などの不可抗力により、本サービスの提供が困難となった場合<br />
                （3）コンピュータまたは通信回線等が事故により停止した場合<br />
                （4）その他、運営者が本サービスの提供が困難と判断した場合<br />
                運営者は、本サービスの提供の停止または中断により、ユーザーまたは第三者が被ったいかなる不利益または損害について、理由を問わず一切の責任を負わないものとします。<br />

                <h4>第6条（利用制限および登録抹消）</h4>
                運営者は、以下の場合には、事前の通知なく、ユーザーに対して、本サービスの全部もしくは一部の利用を制限することができるものとします。<br />
                （1）本規約のいずれかの条項に違反した場合<br />
                （2）その他、運営者が本サービスの利用を適当でないと判断した場合<br />
                運営者は、本条に基づき運営者が行った行為によりユーザーに生じた損害について、一切の責任を負いません。<br />

                <h4>第7条（免責事項）</h4>
                運営者の債務不履行責任は、運営者の故意または重過失によらない場合には免責されるものとします。<br />
                運営者は、何らかの理由によって責任を負う場合にも、通常生じうる損害の範囲内においてのみ賠償の責任を負うものとします。<br />
                運営者は、本サービスに関して、ユーザーと他のユーザーまたは第三者との間において生じた取引、連絡または紛争等について一切責任を負いません。<br />

                <h4>第8条（サービス内容の変更等）</h4>
                運営者は、本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし、これによってユーザーに生じた損害について一切の責任を負いません。<br />

                <h4>第9条（利用規約の変更）</h4>
                運営者は、必要と判断した場合には、いつでも本規約を変更することができるものとします。<br />

                <h4>第10条（通知または連絡）</h4>
                ユーザーと運営者との間の通知または連絡は、本サービス内の各表示、Googleフォーム、SNSアカウント、電子メールを通じて行うものとします。<br />
                運営者は、ユーザーに適切な通知を行うよう務めますが、ユーザーの認識に関わらず、最新の通知および本規約に基づき運営を行います。

                <h4>第11条（準拠法・裁判管轄）</h4>
                本規約の解釈にあたっては、日本法を準拠法とします。<br />
                本サービスに関して紛争が生じた場合には、運営者の本店所在地を管轄する裁判所を専属的合意管轄とします。<br />

            </div>

            <div id="terms-version">
                2018.09.28 公開
            </div>
        </div>
        <style jsx>{`
            #terms-of-use {
                width: 100%;
                padding: 100px;
            }
            #terms-of-use-body {
                width: 80vw;
                margin-left: auto;
                margin-right: auto;
            }
            #terms-of-use-body h4 {
                margin-top: 30px;
            }
            #how-to-body li {
                display: block;
                text-align: left;
                padding: 30px;
            }
            #how-to-body li h4 {
                margin-bottom: 20px;
            }
            #how-to-body li img {
                width: 70px;
                height: 70px;
                object-fit: contain;
            }
            #how-to-body li a { text-decoration: none; color: #04acb4; }
            #how-to-body li a:link { color: #04acb4; }
            #how-to-body li a:visited { color: #04acb4; }
            #how-to-body li a:hover { text-decoration: none; color: #04acb4; }
            #how-to-body li a:active { color: #04acb4; }
        `}</style>
    </div>
)